{"organizations": [], "uuid": "50c8ecc29404562794d6f8615d729ec3263d920f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/37/dd/25/exterior-view.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d229569-Reviews-Forest_Hill_Paris_La_Villette-Paris_Ile_de_France.html", "section_title": "Forest Hill Paris La Villette - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229569-r463288662-Forest_Hill_Paris_La_Villette-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Lowest service level ever", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Lowest service level ever - Review of Forest Hill Paris La Villette, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-27T02:00:00.000+02:00", "replies_count": 0, "uuid": "50c8ecc29404562794d6f8615d729ec3263d920f"}, "author": "Florine C", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229569-r463288662-Forest_Hill_Paris_La_Villette-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Lowest service level ever", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Choosing to stay at this hotel for my business trip was the biggest mistake ever. Except for the proximity to the bank's premises that I was to have meetings in, there is no other positive factor. Being a 4star hotel, I was greatly disappointed in the service rendered.\nOn check-in, the reception was cold - and I thought maybe it was the early hours of the Sunday morning since I arrived at 6.45 am having flown more than 14 hours from Singapore. I reminded the reception that my travel agent had put through a request for a late check out on my departure on Wed night with payment of a half day's charge. I was told that he will need to check with his manager and I was to check back with the reception again on Mon.\nThe worst happened today when I checked with the reception again on the late check-out. The manager to,d me that his assistant will assist me. Whilst he stood next to his assistant and communicated to her in French (knowing full well I spoke only English), his assistant told me that they are overbooked by 7 rooms and thus is not unable to extend my check out time. However, if I were to pay the full rack rate then they are able to extend the check out time as requested. Honestly, I think this is taking advantage of the situation here. Instead of arguing further with them, I told them to please do the extension of checkout time.\nThis is indeed a bad experience and I will surely advise other colleagues coming though Paris not to stay at this hotel. And to think that they get quite considerable business from my bank.", "external_links": [], "published": "2017-02-27T02:00:00.000+02:00", "crawled": "2017-03-28T07:26:32.553+03:00", "highlightTitle": ""}