{"organizations": [], "uuid": "22bdc9515a983e5fa56ee74c5ab57b2f4a4e7818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/e3/ad/c1/reception-islington.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192030-Reviews-Doubletree_by_Hilton_London_Islington-London_England.html", "section_title": "Doubletree by Hilton - London Islington - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192030-r470258272-Doubletree_by_Hilton_London_Islington-London_England.html", "country": "US", "domain_rank": 189, "title": "Good location but lots of room for improvement", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Good location but lots of room for improvement - Review of Doubletree by Hilton - London Islington, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 1, "uuid": "22bdc9515a983e5fa56ee74c5ab57b2f4a4e7818"}, "author": "squidharth", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192030-r470258272-Doubletree_by_Hilton_London_Islington-London_England.html", "ord_in_thread": 0, "title": "Good location but lots of room for improvement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I visited London in February for a business trip and stayed two nights here. The hotel is in close proximity to local shops (restaurants, groceries, etc.) and Angel tube station.\nCheck-in was smooth and the staff were very helpful with getting a lay of the land. The warm chocolate chip cookie never disappoints (Thank you Hilton!). The lobby area is modern with the main restaurant to the left and a bar/coffee area to the right. I spent some time the next day parked by the fire place preparing for my meetings. The room was clean and what I expect from a Hilton property worldwide.\nThere were unfortunately some negative experiences which soured the mood for me. I was assigned a room on the fifth floor and was immediately turned off by a strange smell on that floor. It was very strong for me and musty and I couldn't tell if it was due to cleaning chemicals or something else. The breakfast the next day was also disappointing. The buffet included many choices with cereal, fruit and eggs. I was not expecting to find a clump of hair in my scrambled eggs though! Needless to say I did not finish my breakfast. I did not bring these issues up to the attention of the management. My co-worker had a similar experience the next day with discovering aluminum foil in one of the entrees. He did bring this up to the attention of the management and was compensated for the incident.\nMy stay at the DoubleTree Islington was disappointing. I expect more from a Hilton and unfortunately this stay was below the mark.", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-31T21:50:46.268+03:00", "highlightTitle": ""}